//
//  main.c
//  炸弹人
//
//  Created by Tim on 16/6/16.
//  Copyright © 2016年 cky. All rights reserved.
//
//  PS: (x,y)指第x行第y列
/*
 13 13
 #############
 #GG.GGG#GGG.#
 ###.#G#G#G#G#
 #.......#..G#
 #G#.###.#G#G#
 #GG.GGG.#.GG#
 #G#.#G#.#.###
 ##G...G.....#
 #G#.#G###.#G#
 #...G#GGG.GG#
 #G#.#G#G#.#G#
 #GG.GGG#G.GG#
 #############
 将炸弹放置在(9, 9), 最多可消灭8个敌人
 */
#include <stdio.h>

int main(int argc, const char * argv[])
{
    char a[20][20]; //假设地图大小不超过20*20
    int i, j, sum, map=0, p, q, x, y, n, m;
    //读入n和m, n表示有字符的行数 m表示每一行的列数
    scanf("%d %d", &n, &m);
    
    //读入n行字符
    for(i=0; i<n; i++)
    {
        scanf("%s", a[i]);
    }
    
    //双层循环枚举地图中的每一个点
    for (i=0; i<n; i++)
    {
        for (j=0; j<m; j++)
        {
            //首先判断是不是空地，是平地才可以放置炸弹
            if (a[i][j] == '.')
            {
                //sum 用来计数可以消灭的敌人 ，每次找到一个空地时都需要初始化为0
                sum = 0;
                //将当前坐标i, j赋值给x, y，并开始进行上下左右四个方向分别统计可以消灭的敌人的数量
                x = i;
                y = j;
                
                //向上统计可消灭敌人的数量
                while (a[x][y] != '#')//在不是墙的情况下 枚举
                {
                    //如果遇到敌人 则进行计数
                    if (a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //继续向上寻找
                    x--;
                }
                
                x = i;
                y = j;
                //向下统计可消灭敌人的数量
                while (a[x][y] != '#')//在不是墙的情况下 枚举
                {
                    //如果遇到敌人 则进行计数
                    if (a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //继续向下寻找
                    x++;
                }
                
                x = i;
                y = j;
                //向左统计可消灭敌人的数量
                while (a[x][y] != '#')//在不是墙的情况下 枚举
                {
                    //如果遇到敌人 则进行计数
                    if (a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //继续向左寻找
                    y--;
                }
                
                x = i;
                y = j;
                //向右统计可消灭敌人的数量
                while (a[x][y] != '#')//在不是墙的情况下 枚举
                {
                    //如果遇到敌人 则进行计数
                    if (a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //继续向右寻找
                    y++;
                }
                
                //更新map的数值
                if(sum > map)
                {
                    //更新map数值，保存最新最大消灭敌人的数量
                    map = sum;
                    //记录此时的坐标
                    p = i;
                    q = j;
                }
            }
        }
    }
    printf("将炸弹放置在(%d, %d), 最多可消灭%d个敌人\n", p, q, map);
    getchar();
    getchar();
    return 0;
}
